Revit 2024 API
ExportLinetypeKey Constructor (ExportLinetypeKey)
 Constructs a new copy of the input ExportLinetypeKey object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ExportLinetypeKey(
	ExportLinetypeKey other
)
Visual Basic
Public Sub New ( _
	other As ExportLinetypeKey _
)
Visual C++
public:
ExportLinetypeKey(
	ExportLinetypeKey^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ExportLinetypeKey
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExportLinetypeKey Class
ExportLinetypeKey Overload
Autodesk.Revit.DB Namespace